{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [1, 1, 32, 1], "name": "conv2d_3/kernel", "dtype": "float32"}, {"shape": [1], "name": "conv2d_3/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [2, 2, 256, 512], "name": "conv2d_transpose_10/kernel", "dtype": "float32"}, {"shape": [256], "name": "conv2d_transpose_10/bias", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [2, 2, 128, 256], "name": "conv2d_transpose_11/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv2d_transpose_11/bias", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [2, 2, 64, 128], "name": "conv2d_transpose_12/kernel", "dtype": "float32"}, {"shape": [64], "name": "conv2d_transpose_12/bias", "dtype": "float32"}]}, {"paths": ["group5-shard1of3", "group5-shard2of3", "group5-shard3of3"], "weights": [{"shape": [2, 2, 512, 1024], "name": "conv2d_transpose_9/kernel", "dtype": "float32"}, {"shape": [512], "name": "conv2d_transpose_9/bias", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [3, 3, 3, 32], "name": "conv_0_2/kernel", "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [32], "name": "conv_0_bn_2/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv_0_bn_2/beta", "dtype": "float32"}, {"shape": [32], "name": "conv_0_bn_2/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv_0_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [3, 3, 96, 32], "name": "conv_18_2/kernel", "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [32], "name": "conv_18_bn_2/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv_18_bn_2/beta", "dtype": "float32"}, {"shape": [32], "name": "conv_18_bn_2/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv_18_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [3, 3, 32, 1], "name": "conv_dw_1_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_10_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_10_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_10_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_11_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_11_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_11_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_12_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_12_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_12_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"shape": [3, 3, 1024, 1], "name": "conv_dw_13_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"shape": [1024], "name": "conv_dw_13_bn_2/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn_2/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn_2/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_13_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"shape": [3, 3, 1024, 1], "name": "conv_dw_14_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"shape": [1024], "name": "conv_dw_14_bn_2/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_14_bn_2/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_14_bn_2/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_dw_14_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_15_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_15_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_15_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_15_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_15_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"shape": [3, 3, 256, 1], "name": "conv_dw_16_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"shape": [256], "name": "conv_dw_16_bn_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_16_bn_2/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_16_bn_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_16_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"shape": [3, 3, 128, 1], "name": "conv_dw_17_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"shape": [128], "name": "conv_dw_17_bn_2/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_17_bn_2/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_17_bn_2/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_17_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"shape": [32], "name": "conv_dw_1_bn_2/gamma", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn_2/beta", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn_2/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "conv_dw_1_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"shape": [3, 3, 64, 1], "name": "conv_dw_2_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"shape": [64], "name": "conv_dw_2_bn_2/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn_2/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn_2/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_dw_2_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"shape": [3, 3, 128, 1], "name": "conv_dw_3_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"shape": [128], "name": "conv_dw_3_bn_2/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn_2/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn_2/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_3_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group32-shard1of1"], "weights": [{"shape": [3, 3, 128, 1], "name": "conv_dw_4_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"shape": [128], "name": "conv_dw_4_bn_2/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn_2/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn_2/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_dw_4_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"shape": [3, 3, 256, 1], "name": "conv_dw_5_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"shape": [256], "name": "conv_dw_5_bn_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn_2/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_5_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"shape": [3, 3, 256, 1], "name": "conv_dw_6_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group37-shard1of1"], "weights": [{"shape": [256], "name": "conv_dw_6_bn_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn_2/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_dw_6_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group38-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_7_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group39-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_7_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_7_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group40-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_8_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group41-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_8_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_8_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group42-shard1of1"], "weights": [{"shape": [3, 3, 512, 1], "name": "conv_dw_9_2/depthwise_kernel", "dtype": "float32"}]}, {"paths": ["group43-shard1of1"], "weights": [{"shape": [512], "name": "conv_dw_9_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_dw_9_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group44-shard1of1"], "weights": [{"shape": [1, 1, 32, 64], "name": "conv_pw_1_2/kernel", "dtype": "float32"}]}, {"paths": ["group45-shard1of1"], "weights": [{"shape": [1, 1, 512, 512], "name": "conv_pw_10_2/kernel", "dtype": "float32"}]}, {"paths": ["group46-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_10_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_10_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group47-shard1of1"], "weights": [{"shape": [1, 1, 512, 512], "name": "conv_pw_11_2/kernel", "dtype": "float32"}]}, {"paths": ["group48-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_11_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_11_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group49-shard1of1"], "weights": [{"shape": [1, 1, 512, 1024], "name": "conv_pw_12_2/kernel", "dtype": "float32"}]}, {"paths": ["group50-shard1of1"], "weights": [{"shape": [1024], "name": "conv_pw_12_bn_2/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn_2/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn_2/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_12_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group51-shard1of1"], "weights": [{"shape": [1, 1, 1024, 1024], "name": "conv_pw_13_2/kernel", "dtype": "float32"}]}, {"paths": ["group52-shard1of1"], "weights": [{"shape": [1024], "name": "conv_pw_13_bn_2/gamma", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn_2/beta", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn_2/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "conv_pw_13_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group53-shard1of1"], "weights": [{"shape": [1, 1, 1024, 512], "name": "conv_pw_14_2/kernel", "dtype": "float32"}]}, {"paths": ["group54-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_14_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_14_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_14_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_14_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group55-shard1of1"], "weights": [{"shape": [1, 1, 512, 256], "name": "conv_pw_15_2/kernel", "dtype": "float32"}]}, {"paths": ["group56-shard1of1"], "weights": [{"shape": [256], "name": "conv_pw_15_bn_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_15_bn_2/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_15_bn_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_15_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group57-shard1of1"], "weights": [{"shape": [1, 1, 256, 128], "name": "conv_pw_16_2/kernel", "dtype": "float32"}]}, {"paths": ["group58-shard1of1"], "weights": [{"shape": [128], "name": "conv_pw_16_bn_2/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_16_bn_2/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_16_bn_2/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_16_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group59-shard1of1"], "weights": [{"shape": [1, 1, 128, 64], "name": "conv_pw_17_2/kernel", "dtype": "float32"}]}, {"paths": ["group60-shard1of1"], "weights": [{"shape": [64], "name": "conv_pw_17_bn_2/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_17_bn_2/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_17_bn_2/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_17_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group61-shard1of1"], "weights": [{"shape": [64], "name": "conv_pw_1_bn_2/gamma", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn_2/beta", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn_2/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "conv_pw_1_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group62-shard1of1"], "weights": [{"shape": [1, 1, 64, 128], "name": "conv_pw_2_2/kernel", "dtype": "float32"}]}, {"paths": ["group63-shard1of1"], "weights": [{"shape": [128], "name": "conv_pw_2_bn_2/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn_2/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn_2/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_2_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group64-shard1of1"], "weights": [{"shape": [1, 1, 128, 128], "name": "conv_pw_3_2/kernel", "dtype": "float32"}]}, {"paths": ["group65-shard1of1"], "weights": [{"shape": [128], "name": "conv_pw_3_bn_2/gamma", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn_2/beta", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn_2/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "conv_pw_3_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group66-shard1of1"], "weights": [{"shape": [1, 1, 128, 256], "name": "conv_pw_4_2/kernel", "dtype": "float32"}]}, {"paths": ["group67-shard1of1"], "weights": [{"shape": [256], "name": "conv_pw_4_bn_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn_2/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_4_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group68-shard1of1"], "weights": [{"shape": [1, 1, 256, 256], "name": "conv_pw_5_2/kernel", "dtype": "float32"}]}, {"paths": ["group69-shard1of1"], "weights": [{"shape": [256], "name": "conv_pw_5_bn_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn_2/beta", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "conv_pw_5_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group70-shard1of1"], "weights": [{"shape": [1, 1, 256, 512], "name": "conv_pw_6_2/kernel", "dtype": "float32"}]}, {"paths": ["group71-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_6_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_6_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group72-shard1of1"], "weights": [{"shape": [1, 1, 512, 512], "name": "conv_pw_7_2/kernel", "dtype": "float32"}]}, {"paths": ["group73-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_7_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_7_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group74-shard1of1"], "weights": [{"shape": [1, 1, 512, 512], "name": "conv_pw_8_2/kernel", "dtype": "float32"}]}, {"paths": ["group75-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_8_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_8_bn_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group76-shard1of1"], "weights": [{"shape": [1, 1, 512, 512], "name": "conv_pw_9_2/kernel", "dtype": "float32"}]}, {"paths": ["group77-shard1of1"], "weights": [{"shape": [512], "name": "conv_pw_9_bn_2/gamma", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn_2/beta", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn_2/moving_mean", "dtype": "float32"}, {"shape": [512], "name": "conv_pw_9_bn_2/moving_variance", "dtype": "float32"}]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.2.0", "training_config": {"metrics": [], "loss": "binary_crossentropy", "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false, "decay": 0.0}, "class_name": "Adam"}, "loss_weights": null, "sample_weight_mode": null}, "model_config": {"config": {"input_layers": [["input_3", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_3", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "name": "input_3", "class_name": "InputLayer"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv_0", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 32, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv_0", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_0_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_0", 0, 0, {}]]], "name": "conv_0_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_0_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_0_bn", 0, 0, {}]]], "name": "conv_0_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_1", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_0_relu", 0, 0, {}]]], "name": "conv_dw_1", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_1_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_1_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_1", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_1_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_1_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_2", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_dw_2", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_2_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_2_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_2", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 128, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_2_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_2_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_3", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_3_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_3_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_3", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 128, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_3_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_3_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_4", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_dw_4", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_4_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_4_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_4", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 256, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_4_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_4_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_5", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_5_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_5_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_5", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 256, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_5_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_5_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_6", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_dw_6", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_6_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_6_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_6", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_6_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_6_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_7", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_7_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_7_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_7", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_7_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_7_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_8", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_8_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_8_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_8", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_8_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_8_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_9", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_9_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_9_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_9", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_9_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_9_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_10", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "class_name": "DepthwiseConv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_dw_10_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_dw_10_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "class_name": "Activation"}, {"config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "name": "conv_pw_10", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "linear", "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "class_name": "Conv2D"}, {"config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv_pw_10_bn", "beta_regularizer": null, "trainable": true, "scale": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "conv_pw_10_relu", "activation": "relu6"}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "class_name": "Activation"}, {"config": {"padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv_dw_11", "activation": "linear", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": false, "depthwise_regularizer": null}, "inbound_nodes": 