{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_5", "input_layers": [["input_5", 0, 0]], "output_layers": [["activation_5", 0, 0]], "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_5"}, "inbound_nodes": []}, {"name": "conv_0", "class_name": "Conv2D", "config": {"name": "conv_0", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 32, "kernel_constraint": null, "padding": "same", "kernel_size": [3, 3], "strides": [2, 2], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "conv_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv_0_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_0", 0, 0, {}]]]}, {"name": "conv_0_relu", "class_name": "Activation", "config": {"name": "conv_0_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_0_bn", 0, 0, {}]]]}, {"name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_0_relu", 0, 0, {}]]]}, {"name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_1_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]]}, {"name": "conv_dw_1_relu", "class_name": "Activation", "config": {"name": "conv_dw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]]}, {"name": "conv_pw_1", "class_name": "Conv2D", "config": {"name": "conv_pw_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 64, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]]}, {"name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_1_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]]}, {"name": "conv_pw_1_relu", "class_name": "Activation", "config": {"name": "conv_pw_1_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]]}, {"name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [2, 2], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]]}, {"name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_2_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]]}, {"name": "conv_dw_2_relu", "class_name": "Activation", "config": {"name": "conv_dw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]]}, {"name": "conv_pw_2", "class_name": "Conv2D", "config": {"name": "conv_pw_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]]}, {"name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_2_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]]}, {"name": "conv_pw_2_relu", "class_name": "Activation", "config": {"name": "conv_pw_2_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]]}, {"name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]]}, {"name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_3_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]]}, {"name": "conv_dw_3_relu", "class_name": "Activation", "config": {"name": "conv_dw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]]}, {"name": "conv_pw_3", "class_name": "Conv2D", "config": {"name": "conv_pw_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]]}, {"name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_3_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]]}, {"name": "conv_pw_3_relu", "class_name": "Activation", "config": {"name": "conv_pw_3_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]]}, {"name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [2, 2], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]]}, {"name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_4_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]]}, {"name": "conv_dw_4_relu", "class_name": "Activation", "config": {"name": "conv_dw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]]}, {"name": "conv_pw_4", "class_name": "Conv2D", "config": {"name": "conv_pw_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]]}, {"name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_4_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]]}, {"name": "conv_pw_4_relu", "class_name": "Activation", "config": {"name": "conv_pw_4_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]]}, {"name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]]}, {"name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_5_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]]}, {"name": "conv_dw_5_relu", "class_name": "Activation", "config": {"name": "conv_dw_5_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]]}, {"name": "conv_pw_5", "class_name": "Conv2D", "config": {"name": "conv_pw_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]]}, {"name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_5_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]]}, {"name": "conv_pw_5_relu", "class_name": "Activation", "config": {"name": "conv_pw_5_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]]}, {"name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [2, 2], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]]}, {"name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_6_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]]}, {"name": "conv_dw_6_relu", "class_name": "Activation", "config": {"name": "conv_dw_6_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]]}, {"name": "conv_pw_6", "class_name": "Conv2D", "config": {"name": "conv_pw_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]]}, {"name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_6_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]]}, {"name": "conv_pw_6_relu", "class_name": "Activation", "config": {"name": "conv_pw_6_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]]}, {"name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]]}, {"name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_7_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]]}, {"name": "conv_dw_7_relu", "class_name": "Activation", "config": {"name": "conv_dw_7_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]]}, {"name": "conv_pw_7", "class_name": "Conv2D", "config": {"name": "conv_pw_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]]}, {"name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_7_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]]}, {"name": "conv_pw_7_relu", "class_name": "Activation", "config": {"name": "conv_pw_7_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]]}, {"name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]]}, {"name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_8_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]]}, {"name": "conv_dw_8_relu", "class_name": "Activation", "config": {"name": "conv_dw_8_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]]}, {"name": "conv_pw_8", "class_name": "Conv2D", "config": {"name": "conv_pw_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]]}, {"name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_8_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]]}, {"name": "conv_pw_8_relu", "class_name": "Activation", "config": {"name": "conv_pw_8_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]]}, {"name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]]}, {"name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_9_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]]}, {"name": "conv_dw_9_relu", "class_name": "Activation", "config": {"name": "conv_dw_9_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]]}, {"name": "conv_pw_9", "class_name": "Conv2D", "config": {"name": "conv_pw_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]]}, {"name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_9_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]]}, {"name": "conv_pw_9_relu", "class_name": "Activation", "config": {"name": "conv_pw_9_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]]}, {"name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]]}, {"name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_10_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]]}, {"name": "conv_dw_10_relu", "class_name": "Activation", "config": {"name": "conv_dw_10_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]]}, {"name": "conv_pw_10", "class_name": "Conv2D", "config": {"name": "conv_pw_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]]}, {"name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_10_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]]}, {"name": "conv_pw_10_relu", "class_name": "Activation", "config": {"name": "conv_pw_10_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]]}, {"name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]]}, {"name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_11_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]]}, {"name": "conv_dw_11_relu", "class_name": "Activation", "config": {"name": "conv_dw_11_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]]}, {"name": "conv_pw_11", "class_name": "Conv2D", "config": {"name": "conv_pw_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]]}, {"name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_11_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]]}, {"name": "conv_pw_11_relu", "class_name": "Activation", "config": {"name": "conv_pw_11_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]]}, {"name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [2, 2], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]]}, {"name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_12_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]]}, {"name": "conv_dw_12_relu", "class_name": "Activation", "config": {"name": "conv_dw_12_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]]}, {"name": "conv_pw_12", "class_name": "Conv2D", "config": {"name": "conv_pw_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 1024, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]]}, {"name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_12_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]]}, {"name": "conv_pw_12_relu", "class_name": "Activation", "config": {"name": "conv_pw_12_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]]}, {"name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]]}, {"name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_13_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]]}, {"name": "conv_dw_13_relu", "class_name": "Activation", "config": {"name": "conv_dw_13_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]]}, {"name": "conv_pw_13", "class_name": "Conv2D", "config": {"name": "conv_pw_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 1024, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]]}, {"name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_13_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]]}, {"name": "conv_pw_13_relu", "class_name": "Activation", "config": {"name": "conv_pw_13_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]]}, {"name": "conv2d_transpose_17", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2d_transpose_17", 0, 0, {}], ["conv_pw_11_relu", 0, 0, {}]]]}, {"name": "conv_dw_14", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "conv_dw_14_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_14_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_14", 0, 0, {}]]]}, {"name": "conv_dw_14_relu", "class_name": "Activation", "config": {"name": "conv_dw_14_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_14_bn", 0, 0, {}]]]}, {"name": "conv_pw_14", "class_name": "Conv2D", "config": {"name": "conv_pw_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 512, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_14_relu", 0, 0, {}]]]}, {"name": "conv_pw_14_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_14_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_14", 0, 0, {}]]]}, {"name": "conv_pw_14_relu", "class_name": "Activation", "config": {"name": "conv_pw_14_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_14_bn", 0, 0, {}]]]}, {"name": "conv2d_transpose_18", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "filters": 256, "kernel_constraint": null, "padding": "same", "kernel_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_pw_14_relu", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2d_transpose_18", 0, 0, {}], ["conv_pw_5_relu", 0, 0, {}]]]}, {"name": "conv_dw_15", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"name": "conv_dw_15_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_15_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_15", 0, 0, {}]]]}, {"name": "conv_dw_15_relu", "class_name": "Activation", "config": {"name": "conv_dw_15_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_15_bn", 0, 0, {}]]]}, {"name": "conv_pw_15", "class_name": "Conv2D", "config": {"name": "conv_pw_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "filters": 256, "kernel_constraint": null, "padding": "same", "kernel_size": [1, 1], "strides": [1, 1], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_dw_15_relu", 0, 0, {}]]]}, {"name": "conv_pw_15_bn", "class_name": "BatchNormalization", "config": {"name": "conv_pw_15_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_pw_15", 0, 0, {}]]]}, {"name": "conv_pw_15_relu", "class_name": "Activation", "config": {"name": "conv_pw_15_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_pw_15_bn", 0, 0, {}]]]}, {"name": "conv2d_transpose_19", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "activation": "linear"}, "inbound_nodes": [[["conv_pw_15_relu", 0, 0, {}]]]}, {"name": "concatenate_23", "class_name": "Concatenate", "config": {"name": "concatenate_23", "axis": 3, "trainable": true}, "inbound_nodes": [[["conv2d_transpose_19", 0, 0, {}], ["conv_pw_3_relu", 0, 0, {}]]]}, {"name": "conv_dw_16", "class_name": "DepthwiseConv2D", "config": {"name": "conv_dw_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": false, "strides": [1, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "depthwise_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"name": "conv_dw_16_bn", "class_name": "BatchNormalization", "config": {"name": "conv_dw_16_bn", "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "center": true}, "inbound_nodes": [[["conv_dw_16", 0, 0, {}]]]}, {"name": "conv_dw_16_relu", "class_name": "Activation", "config": {"name": "conv_dw_16_relu", "trainable": true, "activation": "relu6"}, "inbound_nodes": [[["conv_dw_16_bn", 0, 0, {}]]]}, {"name": "conv_pw_16", "class_name": "Conv2D", "config": {"name": "conv_pw_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 